##### 무한 호출로 깊이 제한 초과, 런타임 에러 #####
# def recursive_function():
#    print('재귀 함수를 호출합니다.')
#    recursive_function()
#recursive_function()




# 종료 조건 (i가 100보다 커지면 재귀 호출 종료)
# 출력 결과를 보면 함수 호출은 스택 자료구조임을 알 수 있음.
def recursive_function(i):
    if i >= 100:
        return
    print(i, '번째 재귀 함수에서', i + 1, '번째 재귀 함수를 호출합니다.')
    recursive_function(i + 1)
    print(i, '번째 재귀 함수를 종료합니다.')

recursive_function(1)

########################################################
########################################################
##### 스택 자료구조를 활용해야 하는 상당수 알고리즘은 #####
##### 재귀 함수를 이용해서 간편하게 구현될 수 있다.   #####
########################################################
########################################################